docs/mathematics/linear_algebra/KBrefUpperTriangularMatrix.tex
% Created 2021-09-11 Sat 16:42
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Upper Triangular Matrix}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Upper Triangular Matrix},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{upper triangular matrix\hfill{}\textsc{def}}
\label{sec:org6053de2}
A matrix in which all entries below the \href{KBrefDiagonalOfAMatrix.org}{diagonal} are zero

$\backslash$[\begin{aligned}
\begin{pmatrix}\lambda_1 & &*\\&\ddots&\\0&&\lambda _n\end{pmatrix}
\end{aligned}$\backslash$]
\subsection{results}
\label{sec:org7337190}
\subsubsection{Axler5.26 Conditions for upper-triangular matrix}
\label{sec:org78ebab4}
\begin{quote}
Suppose \(T ;i \mathcal{L} (V)\) and \(v_1, \ldots, v_n\) is a basis of \(V\). The following are equivalent:
\begin{itemize}
\item the matrix of \(T\) with respect to \(v_1, \ldots, v_n\) is upper triangular
\item \(Tv_j \in \ospan(v_1, \ldots, v_j)\) for each \(j = 1, \ldots, n\)
\item The span of each prefix of the basis is invariant under \(T\).
\end{itemize}
\end{quote}
\subsubsection{Axler5.27 Over \(\mathbb{C}\), every operator has an upper-triangular matrix}
\label{sec:org5f9a640}
\begin{quote}
Suppose \(V\) is a finite-dimensional complex vector space and \(T \in  \mathcal{L} (V)\). Then \(T\) has an upper-triangular matrix wrt some basis of \(V\).
\end{quote}
\begin{enumerate}
\item intuition
\label{sec:orgc9017fa}
There are \(n\) eigenvalues (fundamental theorem of linear algebra) and each one should have a corresponding eigenvector that can sweep out a column? What happens when an eigenvalue has higher multiplicity?
\item proof
\label{sec:orgb772416}
\begin{enumerate}
\item induction on the dimension of \(V\). use the fact that the first column can be found, then use the remaining basis vectors as a smaller subspace and do the same thing?
\label{sec:orga9b28fe}
\end{enumerate}
\end{enumerate}
\subsubsection{Axler5.30 Determination of invertibility from upper-triangular matrix}
\label{sec:orgbd0f11a}
\begin{quote}
Suppose \(T \in  \mathcal{L} (V)\) has an upper-tringular matrix wrt some basis of \(V\). Then, \(T\) is invertible iff all the entries on the diagonal of the upper-triangular matrix are nonzero.
\end{quote}
\begin{enumerate}
\item intuition
\label{sec:orgce9fd53}
\begin{enumerate}
\item if one of the diagonal vectors is zero, then there is an injectivity/surjectivity problem and the operator is singular
\label{sec:org20ba230}
\item proof is by assuming all are nonzero and showing surjective, then by contradiction.
\label{sec:org7db3ae0}
\end{enumerate}
\end{enumerate}
\subsubsection{Axler 5.32 Determination of eigenvalues from upper-triangular matrix}
\label{sec:org4e5504a}
\begin{quote}
Suppose \(T \in  \mathcal{L} (V)\) has an upper-triangular matrix wrt some basis of \(V\). Then the eigenvalues of \(T\) are precisely the entries on the diagonal of that upper-triangular matrix.
\end{quote}
\begin{enumerate}
\item proof
\label{sec:org7070186}

\[\begin{aligned}
     \mathcal{M} (T) = \begin{pmatrix}\lambda _1 & & &*\\&\lambda _2&&\\&&\ddots&\\0&&&\lambda _n\end{pmatrix}
	 \mathcal{M} (T-\lambda I) = \begin{pmatrix}\lambda _1-\lambda  & & &*\\&\lambda _2-\lambda &&\\&&\ddots&\\0&&&\lambda _n-\lambda \end{pmatrix}
	 \end{aligned}\]
And that second matrix is only singular when \(\lambda \in \lambda _1, \ldots, \lambda _n\)
\end{enumerate}
\end{document}
